Documents/ПринятиеКУчетуНМА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПринятиеКУчетуНМА</Name>
			<Comment>(Регл)</Comment>
			<BasedOn>
				<xr:Item>Document.ПоступлениеНМА</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПервоначальныеСведенияНМАНалоговыйУчет</xr:Item>
				<xr:Item>InformationRegister.СпособыОтраженияРасходовПоАмортизацииНМА</xr:Item>
				<xr:Item>InformationRegister.СчетаБухгалтерскогоУчетаНМА</xr:Item>
				<xr:Item>AccountingRegister.Налоговый</xr:Item>
				<xr:Item>AccumulationRegister.СтоимостьНМА</xr:Item>
				<xr:Item>InformationRegister.СостоянияНМА</xr:Item>
				<xr:Item>AccumulationRegister.ПоступлениеНМА</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>InformationRegister.МестонахождениеНМА</xr:Item>
				<xr:Item>InformationRegister.СостоянияНМАОрганизаций</xr:Item>
				<xr:Item>InformationRegister.ПервоначальныеСведенияНМАБухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.ПервоначальныеСведенияНМА</xr:Item>
				<xr:Item>InformationRegister.МестонахождениеНМАБухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.СпособыОтраженияРасходовПоАмортизацииНМАБухгалтерскийУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПринятияКУчетуНМА</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Регл) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтраженияРасходов</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияРасходовПоАмортизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачислятьАмортизациюБУ</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачислятьАмортизациюНУ</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НематериальныйАктив</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НематериальныеАктивы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемПродукцииРаботДляВычисленияАмортизации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬОтражатьВНалоговомУчете</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособНачисленияАмортизацииБУ</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНачисленияАмортизацииНМА</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПолезногоИспользованияБУ</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПолезногоИспользованияНУ</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьБУ</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьНУ</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетНачисленияАмортизацииБУ</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаБУ</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаБУВнеоборотногоАктива</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛиквидационнаяСтоимостьБУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговаяГруппаОС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеГруппыОсновныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬУчитываетсяКакОСНУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВводНачальныхОстатков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НакопленнаяАмортизацияБУ</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НакопленнаяАмортизацияНУ</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредседательКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервыйЧленКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВторойЧленКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТретийЧленКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВУправленческомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьУУ</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛиквидационнаяСтоимостьУУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НакопленнаяАмортизацияУУ</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МОЛБУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ОтветственныеЛицаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныеЛицаОрганизаций</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбособленныеПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ОтветственныеЛицаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СостоянияНМА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СостоянияНМА</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСостоянийНМА</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НематериальныйАктив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НематериальныеАктивы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ПоступлениеНМА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ПоступлениеНМА</Name>
			<Comment>На регистре ведется сумма поступивших НМА в упр. валюте</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>В валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НематериальныйАктив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НематериальныеАктивы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/СпособыОтраженияРасходовПоАмортизацииНМА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СпособыОтраженияРасходовПоАмортизацииНМА</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпособОтраженияРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияРасходовПоАмортизации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НематериальныйАктив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НематериальныеАктивы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/МестонахождениеНМА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>МестонахождениеНМА</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МОЛ</Name>
					<Comment>Выбирается из списка регистра сведений Работники</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Местонахождение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НематериальныйАктив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НематериальныеАктивы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыСостоянийНМА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыСостоянийНМА</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Поступил</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятКУчету</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списан</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПринятиеКУчетуНМА/Ext/ObjectModule.bsl
Перем мУдалятьДвижения;

// Строки, хранят реквизиты имеющие смысл только для бух. учета и упр. соответственно
// в случае если документ не отражается в каком-то виде учета, делаются невидимыми
Перем мСтрокаРеквизитыБухУчета Экспорт; // (Регл)
Перем мСтрокаРеквизитыНалУчета Экспорт; // (Регл)

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

// Процедура заполняет структуры именами реквизитов, которые имеют смысл
// только для определенного вида учета
//
Процедура ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчета() Экспорт

	ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчетаРегл();

КонецПроцедуры // ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчета()

// Процедура заполняет структуры именами реквизитов, которые имеют смысл
// только для регламентированного учета
//
Процедура ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчетаРегл()

	мСтрокаРеквизитыБухУчета =  "НачислятьАмортизациюБУ,
								|МОЛБУ,
								|ПодразделениеОрганизации,
								|ОбъемПродукцииРаботДляВычисленияАмортизации,
								|СпособНачисленияАмортизацииБУ,
								|СрокПолезногоИспользованияБУ,
								|СтоимостьБУ,
								|СчетНачисленияАмортизацииБУ,
								|СчетУчетаБУ,
								|СчетУчетаБУВнеоборотногоАктива
								|ЛиквидационнаяСтоимостьБУ
								|";

	мСтрокаРеквизитыНалУчета =  "НачислятьАмортизациюНУ,
								|СрокПолезногоИспользованияНУ,
								|СтоимостьНУ,
								|НачислятьАмортизациюНУ,
								|НалоговаяГруппаОС
								|";                                          
                                                                                
КонецПроцедуры // ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчетаРегл()

#Если Клиент Тогда

// Функция формирует табличный документ с типовой печатной формой НА-1
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьНА1()
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка"      , Ссылка);
	Запрос.УстановитьПараметр("НаДату"      , Дата);
	Запрос.УстановитьПараметр("Организация" , Организация);
	Запрос.УстановитьПараметр("Руководитель", Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
	Запрос.УстановитьПараметр("Бухгалтер"   , Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПринятиеКУчетуНМА.Организация                            КАК Организация,
	|	ПринятиеКУчетуНМА.Организация.НаименованиеПолное         КАК НаименованиеПолноеОрганизации,
	|	КодыОрганизации.КодПоЕДРПОУ                              КАК КодПоЕДРПОУ,
	|	Руководитель.ФизическоеЛицо                              КАК ФИОРук,
	|	Бухгалтер.ФизическоеЛицо                                 КАК ФИОБух,
	|	ПринятиеКУчетуНМА.Дата                                   КАК ДатаДок,
	|	ПринятиеКУчетуНМА.Номер                                  КАК НомерДок,
	|	ПринятиеКУчетуНМА.НематериальныйАктив.НаименованиеПолное КАК НаименованиеПолное,
	|	ПринятиеКУчетуНМА.НематериальныйАктив.ПрочиеСведения     КАК ПрочиеСведения,
	|	ПринятиеКУчетуНМА.НематериальныйАктив.Код                КАК ИнвентарныйНомер,
	|	ПринятиеКУчетуНМА.СчетУчетаБУ                            КАК СчетУчетаБУ,
	|	ПринятиеКУчетуНМА.СчетУчетаБУВнеоборотногоАктива         КАК СчетУчетаБУВнеоборотногоАктива,
	|	ПринятиеКУчетуНМА.СтоимостьБУ                            КАК ПервоначальнаяСтоимость,
	|	ПринятиеКУчетуНМА.СрокПолезногоИспользованияБУ           КАК СрокИспользования,
	|	ПринятиеКУчетуНМА.ЛиквидационнаяСтоимостьБУ              КАК ЛиквидационнаяСтоимость
	|ИЗ
	|	Документ.ПринятиеКУчетуНМА КАК ПринятиеКУчетуНМА
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.КодыОрганизации.СрезПоследних(
	|			                &НаДату, Организация = &Организация) КАК КодыОрганизации
	|		ПО ПринятиеКУчетуНМА.Организация = КодыОрганизации.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
	|		                    &НаДату,
	|		                    СтруктурнаяЕдиница = &Организация
	|			                И ОтветственноеЛицо = &Бухгалтер) КАК Бухгалтер
	|		ПО ПринятиеКУчетуНМА.Организация = Бухгалтер.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
	|		                    &НаДату,
	|		                    СтруктурнаяЕдиница = &Организация
	|			                И ОтветственноеЛицо = &Руководитель) КАК Руководитель
	|		ПО ПринятиеКУчетуНМА.Организация = Руководитель.СтруктурнаяЕдиница
	|ГДЕ
	|	ПринятиеКУчетуНМА.Ссылка = &Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТабДокумент   = Новый ТабличныйДокумент();
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПринятиеКУчетуНМА_НА1";
	Макет         = ПолучитьМакет("НА1");
	
	ВыборкаПоКомиссии = РаботаСДиалогами.ПолучитьСведенияОКомиссии(ЭтотОбъект);
	
	ОбластьМакета = Макет.ПолучитьОбласть("НА1");
	Параметры     = ОбластьМакета.Параметры;
	
	Если Выборка.Следующий() Тогда
		
		Если Выборка.СрокИспользования <> 0 Тогда
			
			Параметры.ГодичнаяСуммаАмортизации = 12 * (Выборка.ПервоначальнаяСтоимость 
													   - Выборка.ЛиквидационнаяСтоимость)
												 / Выборка.СрокИспользования;
			
		КонецЕсли;
		
		Параметры.Заполнить(Выборка);
		Параметры.Заполнить(ВыборкаПоКомиссии);
		
		Параметры.КодПоЕДРПОУ = Выборка.КодПоЕДРПОУ;
		Параметры.ФИОРук      = ОбщегоНазначения.ФамилияИнициалыФизЛица(Выборка.ФИОРук);
		Параметры.ФИОБух      = ОбщегоНазначения.ФамилияИнициалыФизЛица(Выборка.ФИОБух);
		
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьМакета);
	ТабДокумент.ОбластьПечати = ТабДокумент.Область( , 2, , ТабДокумент.ШиринаТаблицы);

	Возврат ТабДокумент;

КонецФункции // ПечатьНА1()

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	Если ИмяМакета = "НА1" Тогда
		
		ТабДокумент = ПечатьНА1();
		
	КонецЕсли;
	
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект, "Принятие к учету НМА"), Ссылка);
	
КонецПроцедуры // Печать

#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("НА1","Форма НА-1");

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА
 
// Процедура определяет параметры учетной политики
//
Процедура ПодготовитьПараметрыУчетнойПолитики(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	СтруктураШапкиДокумента.Вставить("ЕстьНалогНаПрибыль" , Ложь);
	СтруктураШапкиДокумента.Вставить("ЕстьНДС"            , Ложь);
	
	Если НЕ ЗначениеЗаполнено(СтруктураШапкиДокумента.Организация) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	мУчетнаяПолитикаНУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, Отказ, Организация, "Нал");
	
	Если НЕ Отказ Тогда
		
		СтруктураШапкиДокумента.Вставить("ЕстьНалогНаПрибыль" , мУчетнаяПолитикаНУ.СхемаНалогообложения.НалогНаПрибыль = Истина);
		СтруктураШапкиДокумента.Вставить("ЕстьНДС"            , мУчетнаяПолитикаНУ.СхемаНалогообложения.НДС            = Истина);
		
	КонецЕсли;
	
КонецПроцедуры // ПодготовитьПараметрыУчетнойПолитики()

// Дополняет список обязательных параметров шапки
// упр. параметрами
Процедура ДополнитьОбязательныеРеквизитыШапкиУпр(Реквизиты,СтруктураШапкиДокумента)
	
	Если НЕ ОтражатьВУправленческомУчете Тогда
		Возврат;	
	КонецЕсли;	
	
	Реквизиты = Реквизиты + ?(ПустаяСтрока(Реквизиты), "", ", ") + "СтоимостьУУ";

	Если СтруктураШапкиДокумента.Дата > Дата(2009,1,1) Тогда
		Реквизиты = Реквизиты + ?(ПустаяСтрока(Реквизиты), "", ", ") + "Подразделение, МОЛБУ";
	КонецЕсли;	
	
	Если СтруктураШапкиДокумента.НачислятьАмортизациюБУ Тогда
		
		Реквизиты = Реквизиты + " , СпособНачисленияАмортизацииБУ, СпособОтраженияРасходов";
		
		Если ЗначениеЗаполнено(СтруктураШапкиДокумента.СпособНачисленияАмортизацииБУ) Тогда
			
			Если СтруктураШапкиДокумента.СпособНачисленияАмортизацииБУ = Перечисления.СпособыНачисленияАмортизацииНМА.Производственный Тогда
				
				Реквизиты = Реквизиты + ", ОбъемПродукцииРаботДляВычисленияАмортизации";
				
			Иначе
				
				Реквизиты = Реквизиты + ", СрокПолезногоИспользованияБУ";
				
			КонецЕсли;
			
			Если СтруктураШапкиДокумента.СпособНачисленияАмортизацииБУ = Перечисления.СпособыНачисленияАмортизацииНМА.УменьшенияОстатка Тогда
				
				Реквизиты = Реквизиты + ",ЛиквидационнаяСтоимостьУУ";
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

// Дополняет список обязательных параметров шапки
// регл. параметрами
Процедура ДополнитьОбязательныеРеквизитыШапкиРегл(Реквизиты,СтруктураШапкиДокумента)
	
	Если НЕ ОтражатьВБухгалтерскомУчете Тогда
		Возврат;	
	КонецЕсли;	
	
	Реквизиты = Реквизиты + ?(ПустаяСтрока(Реквизиты), "", ", ") + "Организация, СтоимостьБУ, СчетУчетаБУВнеоборотногоАктива, СчетУчетаБУ";

	Если СтруктураШапкиДокумента.Дата > Дата(2009,1,1) Тогда
		Реквизиты = Реквизиты + ?(ПустаяСтрока(Реквизиты), "", ", ") + "ПодразделениеОрганизации, МОЛБУ";
	КонецЕсли;	
	
	Если СтруктураШапкиДокумента.НачислятьАмортизациюБУ Тогда
		
		Реквизиты = Реквизиты + " , СпособНачисленияАмортизацииБУ, СчетНачисленияАмортизацииБУ, СпособОтраженияРасходов";
		
		Если ЗначениеЗаполнено(СтруктураШапкиДокумента.СпособНачисленияАмортизацииБУ) Тогда
			
			Если СтруктураШапкиДокумента.СпособНачисленияАмортизацииБУ = Перечисления.СпособыНачисленияАмортизацииНМА.Производственный Тогда
				
				Реквизиты = Реквизиты + ", ОбъемПродукцииРаботДляВычисленияАмортизации";
				
			Иначе
				
				Реквизиты = Реквизиты + ", СрокПолезногоИспользованияБУ";
				
			КонецЕсли;
			
			Если СтруктураШапкиДокумента.СпособНачисленияАмортизацииБУ = Перечисления.СпособыНачисленияАмортизацииНМА.УменьшенияОстатка Тогда
				
				Реквизиты = Реквизиты + ",ЛиквидационнаяСтоимостьБУ";
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

	Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
		
		
		Реквизиты = Реквизиты + ", НалоговаяГруппаОС";
			
		Если СтруктураШапкиДокумента.СпособНачисленияАмортизацииБУ <> Перечисления.СпособыНачисленияАмортизацииНМА.Производственный Тогда
			Реквизиты = Реквизиты + ", СрокПолезногоИспользованияНУ";
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(РежимПроведения,СтруктураШапкиДокумента, Отказ, Заголовок)

	// Укажем, что надо проверить:
	ОбязательныеРеквизитыШапки = "НематериальныйАктив";
	
	ДополнитьОбязательныеРеквизитыШапкиРегл(ОбязательныеРеквизитыШапки,СтруктураШапкиДокумента);
	ДополнитьОбязательныеРеквизитыШапкиУпр(ОбязательныеРеквизитыШапки,СтруктураШапкиДокумента);

	СтруктураОбязательныхПолей = Новый Структура(ОбязательныеРеквизитыШапки);
	
	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);

	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете И (НЕ Отказ) Тогда
		
		Если СтруктураШапкиДокумента.ЕстьНДС ИЛИ СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
			
			Если НЕ ЗначениеЗаполнено(СтруктураШапкиДокумента.НалоговоеНазначение) Тогда
					
				ОбщегоНазначения.СообщитьОбОшибке("Не заполнено налоговое назначение нематериального актива <" 
								 + СтруктураШапкиДокумента.НематериальныйАктив + ">.", Отказ, Заголовок); 
					
			КонецЕсли;
								 
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

Процедура ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок)
	
	Если Константы.НеИспользоватьДатуАктуальностиУчета.Получить() ИЛИ НЕ Константы.ИнформироватьЕслиУчетНеАктуален.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	МассивРазделовУчета = Новый Массив;
	// в каких видах учета должен отражаться документ
	ОбщегоНазначения.СообщитьОНеактуальностиУчета(СтруктураШапкиДокумента, МассивРазделовУчета, Заголовок);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Процедура формирования движений регистров
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, Отказ, Заголовок)

	ДвиженияПоРегистрамУпр(СтруктураШапкиДокумента, Отказ, Заголовок);
	ДвиженияПоРегистрамРегл(СтруктураШапкиДокумента, Отказ, Заголовок);
	
КонецПроцедуры // ФормированиеДвижений()

// Процедура формирования движений упр. регистров
Процедура ДвиженияПоРегистрамУпр(СтруктураШапкиДокумента,Отказ,Заголовок)
	
	Если Не ОтражатьВУправленческомУчете Тогда
		Возврат;
	КонецЕсли;	
	
	// Движения по регистру Состояние
	Движение = Движения.СостоянияНМА.Добавить();
	Движение.Период                      = СтруктураШапкиДокумента.Дата;
	Движение.НематериальныйАктив         = СтруктураШапкиДокумента.НематериальныйАктив;
	Движение.Состояние                   = Перечисления.ВидыСостоянийНМА.ПринятКУчету;
	
	СостояниеНМА            = Движения.СостоянияНМА;
	УправлениеВнеоборотнымиАктивами.ПроверкаДублированияЗаписейСостоянийНМАУпр(СтруктураШапкиДокумента.Дата,
											СостояниеНМА, Отказ, Заголовок);
											
											
	Если Отказ Тогда
		
		// НМА уже было принято к учету ранее.
		// Повторное принятие к учету НМА недопустимо.
		Возврат;
		
	КонецЕсли; 
	
	Если ВидОперации = Перечисления.ВидыОперацийПринятияКУчетуНМА.НематериальныеАктивы Тогда
		ВыборкаЗаписей = РегистрыНакопления.ПоступлениеНМА.Остатки(,Новый Структура("НематериальныйАктив",НематериальныйАктив));
		ВыборкаСтоимостьУУ = ?(ВыборкаЗаписей.Количество() > 0,ВыборкаЗаписей[0].Сумма,0);
		Если СтоимостьУУ > ВыборкаСтоимостьУУ Тогда
			ОбщегоНазначения.ОшибкаПриПроведении("Стоимость (УУ) для нематериального актива """ + НематериальныйАктив + """ превышает стоимость поступления НМА = " + ОбщегоНазначения.ФорматСумм(ВыборкаСтоимостьУУ,глЗначениеПеременной("ВалютаУправленческогоУчета")),Отказ,Заголовок);
			Возврат;
		КонецЕсли;	

	КонецЕсли;	
	
	// Движения по регистру СпособыОтраженияРасходов
	Движение = Движения.СпособыОтраженияРасходовПоАмортизацииНМА.Добавить();
	Движение.Период                  = СтруктураШапкиДокумента.Дата;
	Движение.НематериальныйАктив     = СтруктураШапкиДокумента.НематериальныйАктив;
	Движение.СпособОтраженияРасходов = СтруктураШапкиДокумента.СпособОтраженияРасходов;

	// Движения по регистру ПервоначальныеСведения
	Движение = Движения.ПервоначальныеСведенияНМА.Добавить();
	Движение.Период                                      = СтруктураШапкиДокумента.Дата;
	Движение.НематериальныйАктив                         = СтруктураШапкиДокумента.НематериальныйАктив;
	Движение.НачислятьАмортизацию 		                 = СтруктураШапкиДокумента.НачислятьАмортизациюБУ;
	Движение.ПервоначальнаяСтоимость                     = СтруктураШапкиДокумента.СтоимостьУУ;
	Движение.ЛиквидационнаяСтоимость                     = СтруктураШапкиДокумента.ЛиквидационнаяСтоимостьУУ;
	Движение.СпособНачисленияАмортизации                 = СтруктураШапкиДокумента.СпособНачисленияАмортизацииБУ;
	Движение.СрокПолезногоИспользования                  = СтруктураШапкиДокумента.СрокПолезногоИспользованияБУ;
	Движение.ОбъемПродукцииРаботДляВычисленияАмортизации = СтруктураШапкиДокумента.ОбъемПродукцииРаботДляВычисленияАмортизации;

	// Движения по регистру МестонахождениеНМА
	Движение = Движения.МестонахождениеНМА.Добавить();
	Движение.Период 				= СтруктураШапкиДокумента.Дата;
	Движение.НематериальныйАктив 	= СтруктураШапкиДокумента.НематериальныйАктив;
	Движение.Местонахождение 		= СтруктураШапкиДокумента.Подразделение;
	Движение.МОЛ 					= СтруктураШапкиДокумента.МОЛБУ;
	
	
	// Движения по регистру СтоимостьНМА
	Движение = Движения.СтоимостьНМА.Добавить();
	Движение.Период                  = СтруктураШапкиДокумента.Дата;
	Движение.НематериальныйАктив     = СтруктураШапкиДокумента.НематериальныйАктив;
	Движение.Амортизация             = СтруктураШапкиДокумента.НакопленнаяАмортизацияУУ;
	Движение.Стоимость               = СтруктураШапкиДокумента.СтоимостьУУ;
	
	Если Не (ВидОперации = Перечисления.ВидыОперацийПринятияКУчетуНМА.ВводНачальныхОстатков) Тогда
		// Движения по регистру ПоступлениеНМА
		ПоступлениеНМА = Движения.ПоступлениеНМА;

		ТаблицаДвиженийПоступлениеНМА = ПоступлениеНМА.Выгрузить();

		Движение = ТаблицаДвиженийПоступлениеНМА.Добавить();
		Движение.НематериальныйАктив = СтруктураШапкиДокумента.НематериальныйАктив;
		Движение.Сумма               = СтруктураШапкиДокумента.СтоимостьУУ;

		ПоступлениеНМА.мПериод          = СтруктураШапкиДокумента.Дата;
		ПоступлениеНМА.мТаблицаДвижений = ТаблицаДвиженийПоступлениеНМА;
		Движения.ПоступлениеНМА.ВыполнитьРасход();
		
	КонецЕсли;	
	
КонецПроцедуры // ФормированиеДвиженийРегл()

// Процедура формирования движений регл. регистров
Процедура ДвиженияПоРегистрамРегл(СтруктураШапкиДокумента,Отказ,Заголовок)
	
	Если Не ОтражатьВБухгалтерскомУчете Тогда
		Возврат;
	КонецЕсли;	
	
	// Движения по регистру Состояние
	Движение = Движения.СостоянияНМАОрганизаций.Добавить();
	Движение.Период                      = СтруктураШапкиДокумента.Дата;
	Движение.НематериальныйАктив         = СтруктураШапкиДокумента.НематериальныйАктив;
	Движение.Организация                 = СтруктураШапкиДокумента.Организация;
	Движение.Состояние                   = Перечисления.ВидыСостоянийНМА.ПринятКУчету;
	
	СостояниеНМА            = Движения.СостоянияНМАОрганизаций;
	УправлениеВнеоборотнымиАктивами.ПроверкаДублированияЗаписейСостоянийНМА(СтруктураШапкиДокумента.Организация,
	                                        СтруктураШапкиДокумента.Дата,
											СостояниеНМА, Отказ, Заголовок);
	
	Если Отказ Тогда
		
		// НМА уже было принято к учету ранее.
		// Повторное принятие к учету НМА недопустимо.
		Возврат;
		
	КонецЕсли; 
		
	Проводки = Движения.Хозрасчетный;
		
	Проводка = Проводки.Добавить();
	Проводка.Активность = Истина;
	Проводка.Период     = СтруктураШапкиДокумента.Дата;

	Проводка.Организация  = СтруктураШапкиДокумента.Организация;
	Если ВидОперации = Перечисления.ВидыОперацийПринятияКУчетуНМА.ВводНачальныхОстатков Тогда
		Проводка.Содержание = "Ввод начальных остатков НМА";
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПринятияКУчетуНМА.НематериальныеАктивы Тогда
		Проводка.Содержание = "Принят к учету НМА";
	Иначе
		Проводка.Содержание = "Списана стоим. объекта строительства";
	КонецЕсли;	
	Проводка.НомерЖурнала = "НА";
	Проводка.Сумма        = СтруктураШапкиДокумента.СтоимостьБУ;

	Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль ИЛИ СтруктураШапкиДокумента.ЕстьНДС Тогда
		
		Проводка.НалоговоеНазначениеДт  = СтруктураШапкиДокумента.НалоговоеНазначение;
		Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
			Проводка.СуммаНУДт 			= СтруктураШапкиДокумента.СтоимостьНУ;
		КонецЕсли;	
		
		Проводка.НалоговоеНазначениеКт  = СтруктураШапкиДокумента.НалоговоеНазначение;
		Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
			Проводка.СуммаНУКт 			= СтруктураШапкиДокумента.СтоимостьНУ;
		КонецЕсли;	
		
	КонецЕсли;
	
	НеОблНДСДеятельность = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность;
	НепроизводственноеНМА = (СтруктураШапкиДокумента.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность);
	
	Если НЕ СтруктураШапкиДокумента.ЕстьНДС Тогда
		// организация - не плательщик НДС. 
		Если НепроизводственноеНМА Тогда
			// Непроизводственное
			Проводка.НалоговоеНазначениеДт = СтруктураШапкиДокумента.НалоговоеНазначение;
		Иначе	
			Проводка.НалоговоеНазначениеДт = НеОблНДСДеятельность;
		КонецЕсли;	
		
		Проводка.НалоговоеНазначениеКт = НеОблНДСДеятельность;
	КонецЕсли;	
	
	Проводка.СчетДт = СтруктураШапкиДокумента.СчетУчетаБУ;
	ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НематериальныеАктивы", СтруктураШапкиДокумента.НематериальныйАктив);

	Проводка.СчетКт = СтруктураШапкиДокумента.СчетУчетаБУВнеоборотногоАктива;
		
	Если СчетУчетаБУВнеоборотногоАктива.ВидыСубконто.Количество() > 0 Тогда
			
		Если ВидОперации = Перечисления.ВидыОперацийПринятияКУчетуНМА.ОбъектыСтроительства Тогда
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ОбъектыСтроительства", СтруктураШапкиДокумента.ОбъектСтроительства);
		Иначе
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "НематериальныеАктивы", СтруктураШапкиДокумента.НематериальныйАктив);
		КонецЕсли;	
			
	КонецЕсли;
		
	Если ВидОперации = Перечисления.ВидыОперацийПринятияКУчетуНМА.ВводНачальныхОстатков И (СтруктураШапкиДокумента.НакопленнаяАмортизацияБУ <> 0 ИЛИ СтруктураШапкиДокумента.НакопленнаяАмортизацияНУ <> 0) Тогда
			
		Проводка = Проводки.Добавить();
		Проводка.Активность = Истина;
		Проводка.Период     = СтруктураШапкиДокумента.Дата;

		Проводка.Организация  = СтруктураШапкиДокумента.Организация;
		Проводка.Содержание   = "Накопленная амортизация НМА";                           
		Проводка.НомерЖурнала = "НА";
		Проводка.Сумма        = СтруктураШапкиДокумента.НакопленнаяАмортизацияБУ;

		Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль ИЛИ СтруктураШапкиДокумента.ЕстьНДС Тогда
				
			Проводка.НалоговоеНазначениеДт  = СтруктураШапкиДокумента.НалоговоеНазначение;
			Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
				Проводка.СуммаНУДт 			= СтруктураШапкиДокумента.НакопленнаяАмортизацияНУ;
			КонецЕсли;	
			
			Проводка.НалоговоеНазначениеКт  = СтруктураШапкиДокумента.НалоговоеНазначение;
			Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
				Проводка.СуммаНУКт 			= СтруктураШапкиДокумента.НакопленнаяАмортизацияНУ;
			КонецЕсли;	
			
		КонецЕсли;
		
		Если НЕ СтруктураШапкиДокумента.ЕстьНДС Тогда
			// организация - не плательщик НДС. 
			Если НепроизводственноеНМА Тогда
				// Непроизводственное
				Проводка.НалоговоеНазначениеДт = СтруктураШапкиДокумента.НалоговоеНазначение;
				Проводка.НалоговоеНазначениеКт = СтруктураШапкиДокумента.НалоговоеНазначение;
			Иначе	
				Проводка.НалоговоеНазначениеДт = НеОблНДСДеятельность;
				Проводка.НалоговоеНазначениеКт = НеОблНДСДеятельность;
			КонецЕсли;	
		КонецЕсли;	
		
		Проводка.СчетДт = СтруктураШапкиДокумента.СчетУчетаБУВнеоборотногоАктива;
			
		Проводка.СчетКт = СтруктураШапкиДокумента.СчетНачисленияАмортизацииБУ;
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "НематериальныеАктивы", СтруктураШапкиДокумента.НематериальныйАктив);
			
	КонецЕсли;
		
	// Движения по регистру СпособыОтраженияРасходов
	Движение = Движения.СпособыОтраженияРасходовПоАмортизацииНМАБухгалтерскийУчет.Добавить();
	Движение.Период                  = СтруктураШапкиДокумента.Дата;
	Движение.НематериальныйАктив     = СтруктураШапкиДокумента.НематериальныйАктив;
	Движение.Организация             = СтруктураШапкиДокумента.Организация;
	Движение.СпособОтраженияРасходов = СтруктураШапкиДокумента.СпособОтраженияРасходов;

	// Движения по регистру ПервоначальныеСведения
	Движение = Движения.ПервоначальныеСведенияНМАБухгалтерскийУчет.Добавить();
	Движение.Период                                      = СтруктураШапкиДокумента.Дата;
	Движение.НематериальныйАктив                         = СтруктураШапкиДокумента.НематериальныйАктив;
	Движение.Организация                                 = СтруктураШапкиДокумента.Организация;
	Движение.НачислятьАмортизацию 		                 = СтруктураШапкиДокумента.НачислятьАмортизациюБУ;
	Движение.ПервоначальнаяСтоимость                     = СтруктураШапкиДокумента.СтоимостьБУ;
	Движение.ЛиквидационнаяСтоимость                     = СтруктураШапкиДокумента.ЛиквидационнаяСтоимостьБУ;
	Движение.СпособНачисленияАмортизации                 = СтруктураШапкиДокумента.СпособНачисленияАмортизацииБУ;
	Движение.СрокПолезногоИспользования                  = СтруктураШапкиДокумента.СрокПолезногоИспользованияБУ;
	Движение.ОбъемПродукцииРаботДляВычисленияАмортизации = СтруктураШапкиДокумента.ОбъемПродукцииРаботДляВычисленияАмортизации;

	// Движения по регистру СчетаБухгалтерскогоУчета
	Движение = Движения.СчетаБухгалтерскогоУчетаНМА.Добавить();
	Движение.Период                      = СтруктураШапкиДокумента.Дата;
	Движение.НематериальныйАктив         = СтруктураШапкиДокумента.НематериальныйАктив;
	Движение.Организация                 = СтруктураШапкиДокумента.Организация;
	Движение.СчетУчета                   = СтруктураШапкиДокумента.СчетУчетаБУ;
	Движение.СчетНачисленияАмортизации   = СтруктураШапкиДокумента.СчетНачисленияАмортизацииБУ;

	// Движения по регистру МестонахождениеНМАБухгалтерскийУчет
	Движение = Движения.МестонахождениеНМАБухгалтерскийУчет.Добавить();
	Движение.Период 				= СтруктураШапкиДокумента.Дата;
	Движение.Организация 			= СтруктураШапкиДокумента.Организация;
	Движение.НематериальныйАктив 	= СтруктураШапкиДокумента.НематериальныйАктив;
	Движение.Местонахождение 		= СтруктураШапкиДокумента.ПодразделениеОрганизации;
	Движение.МОЛ 					= СтруктураШапкиДокумента.МОЛБУ;
	
	Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
		
		Движение = Движения.ПервоначальныеСведенияНМАНалоговыйУчет.Добавить();
		Движение.НематериальныйАктив        = СтруктураШапкиДокумента.НематериальныйАктив;
		Движение.Организация                = СтруктураШапкиДокумента.Организация;
		Движение.Период                     = СтруктураШапкиДокумента.Дата;
		Движение.НачислятьАмортизацию 	    = СтруктураШапкиДокумента.НачислятьАмортизациюНУ;
		Движение.ПервоначальнаяСтоимостьНУ  = СтруктураШапкиДокумента.СтоимостьНУ;
		Движение.СрокПолезногоИспользования = СтруктураШапкиДокумента.СрокПолезногоИспользованияНУ;
		Движение.НалоговоеНазначение        = СтруктураШапкиДокумента.НалоговоеНазначение;
		Движение.НалоговаяГруппаОС          = СтруктураШапкиДокумента.НалоговаяГруппаОС;
		
	Иначе
		
		Движение = Движения.ПервоначальныеСведенияНМАНалоговыйУчет.Добавить();
		Движение.НематериальныйАктив        = СтруктураШапкиДокумента.НематериальныйАктив;
		Движение.Организация                = СтруктураШапкиДокумента.Организация;
		Движение.Период                     = СтруктураШапкиДокумента.Дата;
		Движение.НачислятьАмортизацию 	    = Ложь;
		Движение.ПервоначальнаяСтоимостьНУ  = 0;
		Движение.СрокПолезногоИспользования = 0;
		Движение.НалоговоеНазначение        = СтруктураШапкиДокумента.НалоговоеНазначение;
		Если НЕ СтруктураШапкиДокумента.ЕстьНДС И НЕ НепроизводственноеНМА Тогда
			// организация - не плательщик НДС. 
			Движение.НалоговоеНазначение = НеОблНДСДеятельность;
		КонецЕсли;	
		Движение.НалоговаяГруппаОС          = Справочники.НалоговыеГруппыОсновныхСредств.ПустаяСсылка();
		
	КонецЕсли;
		

КонецПроцедуры // ФормированиеДвиженийРегл()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаЗаполнения(Основание)
	
	Если Не Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Основание)) ИЛИ Основание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Заполним реквизиты из стандартного набора по документу основанию.
	ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеНМА") Тогда
		
		ВидОперации = Перечисления.ВидыОперацийПринятияКУчетуНМА.НематериальныеАктивы;
		
		НематериальныеАктивы           = Основание.НМА;
		НематериальныеАктивыКоличество = НематериальныеАктивы.Количество();
		
		СчетУчетаБУВнеоборотногоАктива = ПланыСчетов.Хозрасчетный.ПриобретениеНематериальныхАктивов;		
		СчетУчетаБУ                    = ПланыСчетов.Хозрасчетный.ДругиеНематериальныеАктивы;
		СчетНачисленияАмортизацииБУ    = ПланыСчетов.Хозрасчетный.НакопленнаяАмортизацияНематериальныхАктивов;
		
		Если НематериальныеАктивыКоличество > 0 Тогда
			
			Если НематериальныеАктивыКоличество > 1 Тогда
				
				ТаблицаНематериальныеАктивы = НематериальныеАктивы.Выгрузить();
				СтрокаТЧ = ТаблицаНематериальныеАктивы.ВыбратьСтроку("Выберите строку документа.");
				
			Иначе
				
				СтрокаТЧ = НематериальныеАктивы[0];
				
			КонецЕсли;
			
			Если СтрокаТЧ <> Неопределено Тогда
				
				НематериальныйАктив 			= СтрокаТЧ.НематериальныйАктив;
				СчетУчетаБУВнеоборотногоАктива 	= СтрокаТЧ.СчетУчетаБУ;
				
			КонецЕсли;
			
			НаДату = Неопределено;
			МассивСубконто = Новый Массив(1);
			МассивСубконто[0] = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НематериальныеАктивы;
			
			//БУ
			СтруктураОтбора = Новый Структура("Счет, Субконто1, Организация");
			СтруктураОтбора.Счет 		= СчетУчетаБУВнеоборотногоАктива;
			СтруктураОтбора.Субконто1 	= НематериальныйАктив;
			СтруктураОтбора.Организация	= Организация;
			ТаблицаОстатков	= РегистрыБухгалтерии.Хозрасчетный.Остатки(НаДату, МассивСубконто, СтруктураОтбора);
			СтоимостьБУ = ТаблицаОстатков.Итог("СуммаОстатокДт");
			СтоимостьНУ = ТаблицаОстатков.Итог("СуммаНУОстатокДт");
			
			//УУ
			ВыборкаЗаписей = РегистрыНакопления.ПоступлениеНМА.Остатки(НаДату,Новый Структура("НематериальныйАктив",НематериальныйАктив));
			СтоимостьУУ = ?(ВыборкаЗаписей.Количество() > 0,ВыборкаЗаписей[0].Сумма,0);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ,РежимПроведения)

	Если мУдалятьДвижения Тогда
    	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);
	
	ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок);
	СтруктураШапкиДокумента.Вставить("НалоговоеНазначение", 
	                                 СтруктураШапкиДокумента.НематериальныйАктив.НалоговоеНазначение);
	СтруктураШапкиДокумента.Вставить("ВидНалоговойДеятельности", 
	                                 СтруктураШапкиДокумента.НалоговоеНазначение.ВидНалоговойДеятельности);

	Если Не СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		
		ОбщегоНазначения.ОшибкаПриПроведении("Документ в обязательном порядке должен отражаться в бухгалтерском учете!",Отказ, Заголовок);
		
	КонецЕсли; 
									 
	// Получим данные учетной политики
	ПодготовитьПараметрыУчетнойПолитики(СтруктураШапкиДокумента, Отказ, Заголовок);

	// Проверим правильность заполнения шапки документа
	ПроверитьЗаполнениеШапки(РежимПроведения, СтруктураШапкиДокумента, Отказ, Заголовок);

	Если НЕ Отказ Тогда
		
		// Формирование движений регистров, бухгалтерских и налоговых проводок.
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, Отказ, Заголовок);
		
	КонецЕсли;
	
	Движения.Хозрасчетный.ВыполнитьДействияПередЗаписьюДвижений();

КонецПроцедуры
                                                                       
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Очистка неиспользуемых реквизитов
	
	СпособыНачисленияАмортизации = Перечисления.СпособыНачисленияАмортизацииНМА;
	
	Если СпособНачисленияАмортизацииБУ = СпособыНачисленияАмортизации.Производственный Тогда
		
		ЛиквидационнаяСтоимостьБУ    = 0;
		СрокПолезногоИспользованияБУ = 0;
		СрокПолезногоИспользованияНУ = 0;
		
	Иначе
				
		ОбъемПродукцииРаботДляВычисленияАмортизации = 0;
		
	КонецЕсли;
	 
	 Если СпособНачисленияАмортизацииБУ = СпособыНачисленияАмортизации.УскоренногоУменьшенияОстатка Тогда
			
		Если СрокПолезногоИспользованияБУ <= 24 Тогда
					
			ОбщегоНазначения.СообщитьОбОшибке(Локализация.СтрШаблон1("Для нематериального актива при расчете по способу ¤1¤ указан срок полезного использования <¤2¤> мес.!"
"Для корректного начисления амортизации срок использования должен быть более 24 месяца.",
											СпособНачисленияАмортизацииБУ, СрокПолезногоИспользованияБУ),);
				
		КонецЕсли; 
	 	
	 КонецЕсли;
	
	Если НематериальныйАктив.НалоговоеНазначение.ВидНалоговойДеятельности = Справочники.ВидыНалоговойДеятельности.НеОблагаемая Тогда
		
		 НачислятьАмортизациюНУ   = Ложь;
		 НакопленнаяАмортизацияНУ = 0;
		 
	Иначе	 
		
		 НачислятьАмортизациюНУ   = НачислятьАмортизациюБУ;
		
	КонецЕсли;	
	
	//Если НЕ НачислятьАмортизациюНУ Тогда
	//	
	//	СрокПолезногоИспользованияНУ = 0;
	//	
	//КонецЕсли;
	
	
	Если ВидОперации = Перечисления.ВидыОперацийПринятияКУчетуНМА.ВводНачальныхОстатков Тогда
		
		СчетУчетаБУВнеоборотногоАктива = ПланыСчетов.Хозрасчетный.Вспомогательный
		
	Иначе
		
		НакопленнаяАмортизацияБУ = 0;
		НакопленнаяАмортизацияНУ = 0;
		
	КонецЕсли;
	
	мУдалятьДвижения = НЕ ЭтоНовый();
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры
